/*
**      +----------+    βιβμιοτελα χχοδα-χωχοδα
**     (c) linlib  !    δμρ αμζαχιτξο-γιζςοχωθ
**      +----------+    χιδεοτεςνιξαμοχ
**/

/*
 *      πομψϊοχατεμψσλικ υςοχεξψ βιβμιοτελι LINLIB
 *      w_help()  πολαϊ σπςαχοώξοκ ιξζοςναγιι
 */

/*
 *      $Header: lin470.cv,v 1.1 89/08/29 14:50:38 vsv Rel $
 *      $Log:	lin470.cv,v $
Revision 1.1  89/08/29  14:50:38  vsv
χεςσιρ LINLIB_3

 */

#include <stdio.h>
#include "line.h"

static
LINE help0[] = {
{ 80, 0, 0, 0, LHDR, 0,0,0, "LINLIB == οσξοχξωε λοναξδω λμαχιατυςω" },
{ 22, 2, 3, 0, LTXT, 0,0,0, "λοξεγ ςαβοτω σ λαδςον:" },
{  8, 2,27, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":GL" },
{ 18, 2,40, 0, LTXT, 0,0,0, "δχιφεξιε πο πομρν:" },
{ 19, 3, 3, 0, LTXT, 0,0,0, "πεςεςισοχατψ όλςαξ:" },
{  8, 3,27, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":RE" },
{  8, 3,40, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":AU" },
{  8, 3,49, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":AD" },
{ 20, 4, 3, 0, LTXT, 0,0,0, "χλμ/χωλμ δοπ. λμαχ.:" },
{  8, 4,27, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":KO" },
{  8, 4,40, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":AL" },
{  8, 4,49, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":AR" },
{  8, 4,58, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":NL" },
{ 26, 6, 3, 0, LTXT, 0,0,0, "υπςαχμεξιε πεςελμΰώατεμεν:" },
{ 18, 6,40, 0, LTXT, 0,0,0, "χωβος πυξλτα νεξΰ:" },
{  7, 7, 3, 0, LTXT, 0,0,0, "χπεςεδ:" },
{  4, 7,13, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":> " },
{  4, 7,19, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":. " },
{ 10, 7,25, 0, LHDR, 0,0,0, "πςοβεμ" },
{ 25, 7,40, 0, LTXT, 0,0,0, "ποδχεδιτε λυςσος, ξαφνιτε" },
{ 10, 7,66, 0, LHDR, 0,0,0, "πςοβεμ" },
{  6, 8, 3, 0, LTXT, 0,0,0, "ξαϊαδ:" },
{  4, 8,13, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":< " },
{  4, 8,19, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":, " },
{  8, 8,25, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":DE" },
{ 30,10, 3, 0, LTXT, 0,0,0, "πεςεθοδ λ ςεδαλτιςοχαξιΰ πομρ:" },
{ 28,11, 6, 0, LTXT, 0,0,0, "- σ σοθςαξεξιεν σοδεςφινοηο:" },
{ 10,11,40, 0, LHDR, 0,0,0, "πςοβεμ" },
{ 15,12, 6, 0, LTXT, 0,0,0, "- σο στιςαξιεν:" },
{  8,12,40, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":DE" },
{ 23,12,51, 0, LTXT, 0,0,0, "(μΰβοκ πεώατξωκ σινχομ)" },
{ 80,14, 0, 0, LHDR, 0,0,0, "λοναξδω ςεδαλτιςοχαξιρ πομρ (ςεδαλτος στςολι)" },
{ 21,16, 1, 0, LTXT, 0,0,0, "λυςσος χ ξαώαμο πομρ:" },
{  8,16,25, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":GL" },
{  8,16,34, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":AL" },
{ 17,16,47, 0, LTXT, 0,0,0, "υδαμεξιε σινχομα:" },
{ 22,17, 1, 0, LTXT, 0,0,0, "λυςσος χ λοξεγ τελστα:" },
{  8,17,25, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":GL" },
{  8,17,34, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":AR" },
{ 17,17,47, 0, LTXT, 0,0,0, "σμεχα οτ λυςσοςα:" },
{  8,17,70, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":DE" },
{ 20,18, 1, 0, LTXT, 0,0,0, "ςεφιν χσταχλα/ϊανεξα" },
{  8,18,25, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":GL" },
{  8,18,34, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":GL" },
{ 13,18,47, 0, LTXT, 0,0,0, "ποδ λυςσοςον:" },
{  8,18,61, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":GL" },
{  8,18,70, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":DE" },
{ 21,19, 1, 0, LTXT, 0,0,0, "χχοδ ξοχοηο ϊξαώεξιρ:" },
{  8,19,25, 0, ATT|MID|PAD, 0, cvt_lh, 0, ":NL" },
{ 0 }, };



w_help(phelp)
/*--------------------------------*/
/* πολαϊατψ σπςαχοώξυΰ ιξζοςναγιΰ */
/*--------------------------------*/
LINE    *phelp;         /* στςαξιγα ποδσλαϊλι */
{
help_1:
	if(phelp) {
		er_pag();
		w_page(phelp);
		switch(r_cod(0)) {
		case KB_RE:      goto help_1;
		case KB_HE:      break;
		default:        goto help_0;
		}
	} else bell();
	;
help_2:
	er_pag();
	w_page(help0);
	switch(r_cod(0)) {
	case KB_RE:      goto help_2;
	case KB_HE:      goto help_1;
	default:        break;
	}
help_0:
	er_pag();
}
