/*
**      +----------+    βιβμιοτελα χχοδα-χωχοδα
**     (c) linlib  !    δμρ αμζαχιτξο-γιζςοχωθ
**      +----------+    χιδεοτεςνιξαμοχ
**/

/*
 *      $Header: lin210.c,v 1.1 90/12/27 16:28:54 vsv Rel $
 *
 *      $Log:	lin210.c,v $
 * Revision 1.1  90/12/27  16:28:54  vsv
 * χεςσιρ LINLIB_3
 * 
 * Revision 3.4  89/08/29  15:14:53  vsv
 * χεςσιρ LINLIB_3
 * 
 * Revision 3.3  88/07/28  09:23:43  vsv
 * ςαβοτα σ λμαχιϋεκ 'DEL' πςιχεδεξα λ οβύενυ χιδυ
 * 
 * Revision 3.2  88/06/27  15:19:23  vsv
 * ςεχιϊιρ αςθιχα RCS
 * 
 * Revision 3.1  88/04/29  12:24:13  vsv
 * ςαϊδεμεξω ταβμιγω ι πςογεδυςω,
 * ινεετσρ δχα ςαϊξωθ νοδυμρ
 * 
 */

#include <stdio.h>
#include "line.h"
#include "line0.h"
#include "lineva.h"

/*
 * ξαστςοκλα ξα τιπ τεςνιξαμα
 *
 * termcap ξε σοχσεν υδοβεξ, ταλ λαλ
 * τςεβυετ πυθμοηο λοδα, λοτοςωκ
 * ισπομψϊυετσρ τομψλο οδιξ ςαϊ.
 * χοϊνοφξο, μυώϋε ξαστςοκλυ ιϊ termcap
 * ηοτοχιτψ οτδεμψξο, ϊατεν χ υφε υπαλοχαξξον χιδε
 * σώιτωχατψ ϊα οδξο οβςαύεξιε λ ζακμυ.
 * πςινεώαξιε.  ςαβοταεν
 * σ termcap, τομψλο HELP χωτασλιχαεν πο λμΰώυ :lh= ... :
 *
 * χ ότον ζακμε οβ'χμεξω δαξξωε, τςεβυενωε δμρ
 * οπισαξιρ χοϊνοφξοστεκ τεςνιξαμα.
 * νοφξο οβ'ρχιτψ χσε στςολι ΕΣΓ-ποσμεδοχατεμψξοστεκ
 * λοξσταξτανι, ι ζυξλγιΰ hw_set λαλ πυστυΰ -
 * ςαϊνες λοδα ισπομξρΰύεκ βιβμιοτελι
 * υνεξψϋιτσρ ϊα σώετ ποτεςι ξεϊαχισινοστι οτ
 * τιπα τεςνιξαμα.
 */


/* χξεϋξιε πεςενεξξωε δμρ tgoto() ιϊ termcap */
char *UP = NULL;        /* πεςενεστιτψ λυςσος χχεςθ ξα 1 ποϊιγιΰ */
char *BC = NULL;        /* ---------""------- χμεχο -----""----- */

/* ςαϊνεςω όλςαξα */
int     maxli = 24;     /* ςαϊνες πο χεςτιλαμι */
int     maxco = 80;     /* --"-- πο ηοςιϊοξταμι */


/*---------------------*/
/* οπισαξιε λμαχιατυςω */
/*---------------------*/

KBF   kbf[] = {

/*      λοδ χοϊχςαύαετσρ πο ϊαπςοσυ r_key();
 *      χτοςωε όμενεξτω ϊαπομξρΰτσρ hw_set(),
 *      ιμι χςυώξυΰ δμρ οπισαξιρ εδιξστχεξξοηο
 *      δισπμερ. χ ποσμεδξεν σμυώαε νοφξο
 *      ιϊνεξιτψ λομιώεστχο λμαχιϋ, ι/ιμι ϊαξεστι
 *      λοξσταξτξωε οπισαξιρ χ ταβμιγυ kbl (σν. ξιφε).
 */
{ KBCOD('k','u'), 0 },
{ KBCOD('k','d'), 0 },
{ KBCOD('k','l'), 0 },
{ KBCOD('k','r'), 0 },
{ KBCOD('k','1'), 0 },
{ KBCOD('k','2'), 0 },
{ KBCOD('k','3'), 0 },
{ KBCOD('k','4'), 0 },
{ KBCOD('I','C'), 0 },
{ KBCOD('D','C'), 0 },
{ KBCOD('I','L'), 0 },
{ KBCOD('D','L'), 0 },
{ KBCOD('k','h'), 0 },
{ KBCOD('f','.'), 0 },
{ KBCOD('f','-'), 0 },
{ KBCOD('f',','), 0 },
{ KBCOD('f','0'), 0 },
{ KBCOD('f','1'), 0 },
{ KBCOD('f','2'), 0 },
{ KBCOD('f','3'), 0 },
{ KBCOD('f','4'), 0 },
{ KBCOD('f','5'), 0 },
{ KBCOD('f','6'), 0 },
{ KBCOD('f','7'), 0 },
{ KBCOD('f','8'), 0 },
{ KBCOD('f','9'), 0 },
{ 0, 0 },
};

/* οπισαξιε χοϊνοφξοστεκ χωχοδα ξα όλςαξ */
/*
 * ζυξλγιρ hw_set ϊανεξρετ στςολι, λοτοςωε ρχμρΰτσρ
 * λμΰώανι χοϊνοφξοστεκ τεςνιξαμα, σν. termcap(5)
 * ξα στςολι ϊξαώεξικ ότιθ λμΰώεκ.
 * δμρ οπισαξιρ εδιξστχεξξοηο τεςνιξαμα ϊανεξιτε λμΰώι ξα ϊξαώεξιρ
 * (τ.ε. ξα σοοτχετστχυΰύιε ESC-ποσμεδοχατεμψξοστι)
 * ι πονεστιτε χ ότον ζακμε οπισαξιε πυστοκ ζυξλγιι "hw_set() {}"
 */
char *tcapo[] = {
	"cm", "cl", "cd", "ce", "ks", "ke",
	"cs", "sr", "sf", "al", "dl",
	"so", "se", "us", "ue",
	"md", "mr", "mb", "mk", "me",
	"bl", "vb",
	"lh",   /* ινρ λμαχιατυςω */
	0 };

/* σχρϊψ ζιϊιώεσλιθ ι μοηιώεσλιθ λοδοχ, α ταλφε ινεξ λμαχιϋ */
KBL kbl[KBLSIZE] = {
		/*==== οσξοχξωε λοναξδω */
      { KBCOD('k','3'),   KB_KP,   "PF3    " },    /* KEYPAD ON */
      { KBCOD('k','u'),   KB_AU,   "χχεςθ  " },
      { KBCOD('k','d'),   KB_AD,   "χξιϊ   " },
      { KBCOD('k','l'),   KB_AL,   "χμεχο  " },
      { KBCOD('k','r'),   KB_AR,   "χπςαχο " },
      { KBCTL(    'M'),   KB_NL,   "RETURN " },    /* χχοδ (λοξεγ στςολι) */
      { KBCOD('d','e'),   KB_DE,   "DEL    " },    /* ϊαβοκ */
      { KBCOD('k','1'),   KB_EX,   "PF1    " },    /* πςεζιλσ (GOLD) */
      { KBCOD('k','2'),   KB_HE,   "PF2    " },    /* σπςαχ. ιξζ. (HELP) */
      { KBCOD('k','4'),   KB_PR,   "PF4    " },    /* πεώατψ όλςαξα */
      { KBCTL(    'A'),   KB_RE,   "CTRL-A " },    /* οσχεφιτψ (REFRESH) */
      { KBCTL(    'I'),   KB_TA,   "TAB    " },    /* ταβυμργιρ */
		/*==== δοπομξιτεμψξωε λοναξδω */
      { KBCOD('f','0'),   KBUSR('0'),   0         },
      { KBCOD('f','1'),   KBUSR('1'),   0         },
      { KBCOD('f','2'),   KBUSR('2'),   0         },
      { KBCOD('f','3'),   KBUSR('3'),   0         },
      { KBCOD('f','4'),   KBUSR('4'),   0         },
      { KBCOD('f','5'),   KBUSR('5'),   0         },
      { KBCOD('f','6'),   KBUSR('6'),   0         },
      { KBCOD('f','7'),   KBUSR('7'),   0         },
      { KBCOD('f','8'),   KBUSR('8'),   0         },
      { KBCOD('f','9'),   KBUSR('9'),   0         },
      { KBCOD('f','.'),   KBUSR('.'),   0         },
      { KBCOD('f','-'),   KBUSR('-'),   0         },
      { KBCOD('f',','),   KBUSR(','),   0         },
      { KBCTL(    'J'),   KB_NL,   0         },    /*==== σιξοξινω */
      { KBCTL(    'H'),   KB_HE,   0         },
      { KBCTL(    'E'),   KB_EX,   0         },
      { KBCOD('k','h'),   KB_EX,   0         },
      { KBCTL(    'R'),   KB_RE,   0         },
      { 0 },
	};


LPA lpaout[LPASIZE] = {
	{       ' ',    0       },
	{       ' ',    0       },              /* TXT  */
	{       ' ',    0       },              /* HDR  */
	{       '>',    0       },              /* VAR  */
	{       '>',    0       },              /* ALT  */
	{       '-',    0       },              /* MSE  */
	{       ' ',    A_US|A_MD },            /* ERR  */
	{       '!',    A_SO    },              /* ATT  */
};

LPA lpainp[LPASIZE] = {
	{       ' ',    0       },
	{       ' ',    A_SO    },              /* TXT  */
	{       ' ',    A_SO    },              /* HDR  */
	{       '#',    A_SO    },              /* VAR  */
	{       '?',    A_SO    },              /* ALT  */
	{       '*',    A_SO    },              /* MSE  */
	{       ' ',    A_US|A_MD },            /* ERR  */
	{       ' ',    A_MB    },              /* ATT  */
};
